; domain
(define (domain strips_gripper_x_1-domain)
 (:requirements :strips :typing)
 (:predicates (room ?r - object) (ball ?b - object) (gripper ?g - object) (at_robby ?r - object) (at_ ?b - object ?r - object) (free ?g - object) (carry ?o - object ?g - object))
 (:action move
  :parameters ( ?from - object ?to - object)
  :precondition (and (room ?from) (room ?to) (at_robby ?from))
  :effect (and (at_robby ?to) (not (at_robby ?from))))
 (:action pick
  :parameters ( ?obj - object ?room - object ?gripper - object)
  :precondition (and (ball ?obj) (room ?room) (gripper ?gripper) (at_ ?obj ?room) (at_robby ?room) (free ?gripper))
  :effect (and (carry ?obj ?gripper) (not (at_ ?obj ?room)) (not (free ?gripper))))
 (:action drop
  :parameters ( ?obj - object ?room - object ?gripper - object)
  :precondition (and (ball ?obj) (room ?room) (gripper ?gripper) (carry ?obj ?gripper) (at_robby ?room))
  :effect (and (at_ ?obj ?room) (free ?gripper) (not (carry ?obj ?gripper))))
)

; problem
(define (problem strips_gripper_x_1-problem)
 (:domain strips_gripper_x_1-domain)
 (:objects
   rooma roomb ball4 ball3 ball2 ball1 left right - object
 )
 (:init (room rooma) (room roomb) (ball ball4) (ball ball3) (ball ball2) (ball ball1) (at_robby rooma) (free left) (free right) (at_ ball4 rooma) (at_ ball3 rooma) (at_ ball2 rooma) (at_ ball1 rooma) (gripper left) (gripper right))
 (:goal (and (at_ ball4 roomb) (at_ ball3 roomb) (at_ ball2 roomb) (at_ ball1 roomb)))
)

; plan
1. (pick ball1 rooma left)
   deleted: (at_ ball1 rooma) (free left)
   added: (carry ball1 left)
   goals met: 0 of 4
2. (pick ball2 rooma right)
   deleted: (at_ ball2 rooma) (free right)
   added: (carry ball2 right)
   goals met: 0 of 4
3. (move rooma roomb)
   deleted: (at_robby rooma)
   added: (at_robby roomb)
   goals met: 0 of 4
4. (drop ball1 roomb left)
   deleted: (carry ball1 left)
   added: (at_ ball1 roomb) (free left)
   goals met: 1 of 4
5. (drop ball2 roomb right)
   deleted: (carry ball2 right)
   added: (at_ ball2 roomb) (free right)
   goals met: 2 of 4
6. (move roomb rooma)
   deleted: (at_robby roomb)
   added: (at_robby rooma)
   goals met: 2 of 4
7. (pick ball3 rooma left)
   deleted: (at_ ball3 rooma) (free left)
   added: (carry ball3 left)
   goals met: 2 of 4
8. (pick ball4 rooma right)
   deleted: (at_ ball4 rooma) (free right)
   added: (carry ball4 right)
   goals met: 2 of 4
9. (move rooma roomb)
   deleted: (at_robby rooma)
   added: (at_robby roomb)
   goals met: 2 of 4
10. (drop ball3 roomb left)
   deleted: (carry ball3 left)
   added: (at_ ball3 roomb) (free left)
   goals met: 3 of 4
11. (drop ball4 roomb right)
   deleted: (carry ball4 right)
   added: (at_ ball4 roomb) (free right)
   goals met: 4 of 4
